<?php
/**
 * Created by PhpStorm.
 * User: dell
 * Date: 2016/3/2
 * Time: 9:42
 */
return [
    '科目编号' => 'Subject No.',
    '科目名称' => 'Subject Name',
    '科目类别' => 'Subject Category',
    '报表名称' => 'Report Name',
    '科目余额' => 'Subject Balance',
    '首页' => 'First Page',
    '下一页' => 'Next',
    '上一页' => 'Previous',
    //资产类 Assets
    '流动资产' => 'Current assets',    //
    '货币资金' => 'Cash and cash equivalents',    //
    '银行存款' => 'Cash in bank',
    '库存现金' => 'Cash on hand',

//    '交易性金融资产' => '',
//    '应收分保账款' => '',
//    '材料采购' => '',
//    '在途物资' => '',
//    '发出商品' => '',
//    '包装物及低值易耗品' => '',
//    '融资租赁资产' => '',
//    '持有至到期投资' => '',
//    '持有至到期投资减值准备' => '',
//    '可供出售金融资产' => '',
//    '长期股权投资减值准备' => '',
//    '投资性房地产' => '',
//    '长期应收款' => '',
//    '累计摊销' => '',
//    '递延所得税资产' => '',
//    '待处理财产损益' => '',
//    '交易性金融负债' => '',
//    '应付职工薪酬' => '',
//    '应交税费' => '',
//    '应付利息' => '',
//    '递延收益' => '',
//    '递延所得税负债' => '',
//    '一般风险准备' => '',
//    '库存股' => '',
//    '利息收入' => '',
//    '手续费及佣金收入' => '',
//    '保费收入' => '',
//    '租赁收入' => '',
//    '汇兑损益' => '',
//    '公允价值变动损益' => '',
//    '摊回保险责任准备金' => '',
//    '摊回赔付支出' => '',
//    '摊回分保费用' => '',
//    '营业税金及附加' => '',
//    '利息支出' => '',
//    '手续费及佣金支出' => '',
//    '提取未到期责任准备金' => '',
//    '提取保险责任准备金' => '',
//    '赔付支出' => '',
//    '保户红利支出' => '',
//    '退保金' => '',
//    '分出保费' => '',
//    '分保费用' => '',
//    '销售费用' => '',
//    '勘探费用' => '',
//    '资产减值损失' => '',
//    '企业所得税费用' => '',
//    '以前年度损益调整' => '',




];