-- MySQL dump 10.13  Distrib 5.5.40, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: account_test
-- ------------------------------------------------------
-- Server version	5.5.40-0ubuntu0.14.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `bank`
--

DROP TABLE IF EXISTS `bank`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bank` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `target` varchar(512) DEFAULT NULL COMMENT '交易对象',
  `date` varchar(64) DEFAULT NULL COMMENT '日期',
  `memo` text COMMENT '说明',
  `amount` float NOT NULL COMMENT '金额',
  `parent` int(11) DEFAULT NULL COMMENT '父，相关',
  `order` text COMMENT '订单号',
  `subject` varchar(16) DEFAULT NULL COMMENT '科目',
  `subject_2` varchar(16) DEFAULT NULL,
  `invoice` tinyint(4) DEFAULT '0' COMMENT '有无发票',
  `tax` int(8) DEFAULT NULL COMMENT '税率',
  `status_id` tinyint(4) NOT NULL DEFAULT '0' COMMENT '1:已经生成凭证 ',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `status_id` (`status_id`),
  KEY `created_at` (`created_at`),
  KEY `updated_at` (`updated_at`),
  KEY `parent` (`parent`)
) ENGINE=InnoDB AUTO_INCREMENT=557 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bank`
--

LOCK TABLES `bank` WRITE;
/*!40000 ALTER TABLE `bank` DISABLE KEYS */;
INSERT INTO `bank` VALUES (374,'上海市数字证书认证中心有限公司','20150225','企业证书费用',300,NULL,NULL,'660102','100201',0,0,1,'2015-05-22 05:57:23',1432274243),(375,'','20150225','服务费',500,NULL,NULL,'660206','100201',0,0,1,'2015-05-22 05:57:23',1432274243),(376,'b公司','20150225','借款',800,NULL,NULL,'224101','100201',0,0,1,'2015-05-22 05:57:23',1432274243),(377,'重庆猪八戒网络有限公司','20150227','圈圈橙的文字商标注册费用',1500,NULL,NULL,'660102','100201',0,0,1,'2015-05-22 05:57:23',1432274243),(378,'朱筠','20150227','投资款',10000,NULL,NULL,'4001','100201',0,0,1,'2015-05-22 05:57:23',1432274243),(379,'','20150302','手续费',4,NULL,NULL,'660301','100201',0,0,1,'2015-05-22 06:11:25',1432275085),(380,'','20150302','手续费',0.4,NULL,NULL,'660301','100201',0,0,1,'2015-05-22 06:11:25',1432275085),(381,'朱筠','20150304','上海银行基本账户开户费用',800,NULL,NULL,'660102','100201',0,0,1,'2015-05-22 06:11:25',1432275085),(382,'朱筠','20150304','亿美软通短信通道服务费',5000,NULL,NULL,'660206','100201',0,0,1,'2015-05-22 06:11:25',1432275085),(383,'朱筠','20150304','阿里云服务器租赁年费',68,NULL,NULL,'660210','100201',0,0,1,'2015-05-22 06:11:25',1432275085),(384,'朱筠','20150304','公司注册费用',500,NULL,NULL,'660102','100201',0,0,1,'2015-05-22 06:11:25',1432275085),(385,'朱筠','20150304','朱筠投资款',10000,NULL,NULL,'4001','100201',0,0,1,'2015-05-22 06:11:25',1432275085),(386,'老法师（上海）财务咨询有限公司','20150304','3个月财务代理费用',900,NULL,NULL,'660206','100201',0,0,1,'2015-05-22 06:11:25',1432275085),(387,'陆晓峰','20150315','注资',50000,NULL,NULL,'4001','100201',0,0,1,'2015-05-22 06:11:25',1432275085),(388,'朱筠','20150316','税务盘购买',1020,NULL,NULL,'660102','100201',0,0,1,'2015-05-22 06:11:26',1432275086),(389,'','20150320','利息收入',10.02,NULL,NULL,'660302','100201',0,0,1,'2015-05-22 06:11:26',1432275086),(390,'朱筠','20150330','差旅费',346,NULL,NULL,'660212','100201',0,0,1,'2015-05-22 06:11:26',1432275086),(391,'顾雨婷','20150331','微信收入',0.13,NULL,NULL,'6301','100201',0,0,1,'2015-05-22 06:11:26',1432275086),(392,'朱筠','20150331','朱筠的第二笔投资款',50000,NULL,NULL,'4001','100201',0,0,1,'2015-05-22 06:11:26',1432275086),(393,'朱筠','20150331','电脑购买',9195,NULL,NULL,'160101','100201',0,0,1,'2015-05-22 06:11:26',1432275086),(394,'深圳市腾讯计算机系统有限公司','20150331','微信收入',0.01,NULL,NULL,'6301','100201',0,0,1,'2015-05-22 06:11:26',1432275086),(396,'--','20150421','手续费',35,NULL,NULL,'','100201',0,0,0,'2015-05-25 06:42:04',1432536124),(397,'上海市公积金管理中心（静安支行）','20150423','公积金',3360,NULL,NULL,'','100201',0,0,0,'2015-05-25 06:42:04',1432536124),(398,'--','20150428','手续费',1,NULL,NULL,'','100201',0,0,0,'2015-05-25 06:42:04',1432536124),(399,'阳君','20150429','工资奖金收入',3300,NULL,NULL,'','100201',0,0,0,'2015-05-25 06:42:04',1432536124),(400,'赵新伟','20150429','工资奖金收入',3300,NULL,NULL,'','100201',0,0,0,'2015-05-25 06:42:04',1432536124),(401,'嵇正超','20150429','工资奖金收入',3300,NULL,NULL,'','100201',0,0,0,'2015-05-25 06:42:04',1432536124),(402,'陈一菠','20150429','工资奖金收入',354.55,NULL,NULL,'','100201',0,0,0,'2015-05-25 06:42:04',1432536124),(403,'张丹洁','20150429','工资奖金收入',3300,NULL,NULL,'','100201',0,0,0,'2015-05-25 06:42:04',1432536124),(404,'杨润华','20150429','工资奖金收入',3300,NULL,NULL,'','100201',0,0,0,'2015-05-25 06:42:04',1432536124),(405,'李旭辉','20150429','工资奖金收入',3300,NULL,NULL,'','100201',0,0,0,'2015-05-25 06:42:04',1432536124),(406,'易超','20150429','工资奖金收入',3445,NULL,NULL,'','100201',0,0,0,'2015-05-25 06:42:04',1432536124),(407,'张志辉','20150429','工资奖金收入',3506.62,NULL,NULL,'','100201',0,0,0,'2015-05-25 06:42:04',1432536124),(408,'褚魁','20150429','工资奖金收入',2825,NULL,NULL,'','100201',0,0,0,'2015-05-25 06:42:04',1432536124),(409,'施威','20150429','工资奖金收入',2256.82,NULL,NULL,'','100201',0,0,0,'2015-05-25 06:42:04',1432536124),(410,'陈军','20150429','工资奖金收入',1359.09,NULL,NULL,'','100201',0,0,0,'2015-05-25 06:42:04',1432536124),(441,'国家金库上海市奉贤区支库','20150420','个税',1150,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 07:06:59',1432537643),(457,'--','20150421','手续费',35,NULL,NULL,'1','100201',0,0,0,'2015-05-25 07:13:19',1432537999),(458,'国家金库上海市奉贤区支库','20150420','个税',1150,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 07:16:51',1432538211),(474,'a公司','20150301','项目转账',5000,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 07:23:29',1432538609),(475,'押金','20150301','项目转账',5000,NULL,NULL,'122103','100201',0,0,1,'2015-05-25 07:23:29',1432538609),(476,'','20150302','项目转账',5,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 07:24:45',1432538685),(477,'b公司','20150302','项目转账',5,NULL,NULL,'122102','100201',0,0,1,'2015-05-25 07:24:45',1432538685),(478,'某某某公司','20150301','项目转账',5000,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 07:26:40',1432538800),(534,'董凌虹','20150415','备用金',50000,NULL,NULL,'1001','100201',0,0,1,'2015-05-25 08:56:16',1432544176),(535,'国家金库上海市奉贤区支库','20150420','个税',1150,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 08:56:16',1432544176),(536,'--','20150421','手续费',35,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 08:56:16',1432544176),(537,'上海市公积金管理中心（静安支行）','20150423','公积金',3360,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 08:56:17',1432544177),(538,'--','20150428','手续费',1,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 08:56:17',1432544177),(539,'阳君','20150429','工资奖金收入',3300,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 08:56:17',1432544177),(540,'赵新伟','20150429','工资奖金收入',3300,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 08:56:17',1432544177),(541,'嵇正超','20150429','工资奖金收入',3300,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 08:56:17',1432544177),(542,'陈一菠','20150429','工资奖金收入',354.55,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 08:56:17',1432544177),(543,'张丹洁','20150429','工资奖金收入',3300,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 08:56:17',1432544177),(544,'杨润华','20150429','工资奖金收入',3300,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 08:56:17',1432544177),(545,'李旭辉','20150429','工资奖金收入',3300,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 08:56:17',1432544177),(546,'易超','20150429','工资奖金收入',3445,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 08:56:17',1432544177),(547,'张志辉','20150429','工资奖金收入',3506.62,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 08:56:17',1432544177),(548,'褚魁','20150429','工资奖金收入',2825,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 08:56:17',1432544177),(549,'施威','20150429','工资奖金收入',2256.82,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 08:56:17',1432544177),(550,'陈军','20150429','工资奖金收入',1359.09,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 08:56:17',1432544177),(551,'董凌虹','20150415','备用金',50000,NULL,NULL,'4001','100201',0,0,1,'2015-05-25 09:00:55',1432544455),(552,'国家金库上海市奉贤区支库','20150420','个税',1150,NULL,NULL,'222101','100201',0,0,1,'2015-05-25 09:00:55',1432544455),(553,'--','20150421','手续费',35,NULL,NULL,'660301','100201',0,0,1,'2015-05-25 09:00:55',1432544455),(554,'国家金库上海市奉贤区支库','20150420','个税',112,NULL,NULL,'222101','100201',0,0,1,'2015-06-07 05:40:14',1433920840),(555,'--','20150421','手续费',31,NULL,NULL,'660301','100203',0,0,0,'2015-06-07 05:40:14',1433920489),(556,'AAADFAS','20150609','fsadfasd',1033,NULL,NULL,'224101','100203',0,0,1,'2015-06-09 11:49:02',1433995279);
/*!40000 ALTER TABLE `bank` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cash`
--

DROP TABLE IF EXISTS `cash`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `cash` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `target` varchar(512) DEFAULT NULL COMMENT '交易对象',
  `date` varchar(64) DEFAULT NULL COMMENT '日期',
  `memo` text COMMENT '说明',
  `amount` float NOT NULL COMMENT '金额',
  `parent` int(11) DEFAULT NULL COMMENT '父，相关',
  `order` text COMMENT '订单号',
  `subject` varchar(16) DEFAULT NULL COMMENT '科目',
  `subject_2` int(12) NOT NULL,
  `invoice` tinyint(4) DEFAULT '0' COMMENT '有无发票',
  `tax` int(8) DEFAULT NULL COMMENT '税率',
  `status_id` tinyint(4) NOT NULL DEFAULT '0' COMMENT '1:已经生成凭证 ',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `status_id` (`status_id`),
  KEY `created_at` (`created_at`),
  KEY `updated_at` (`updated_at`),
  KEY `parent` (`parent`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cash`
--

LOCK TABLES `cash` WRITE;
/*!40000 ALTER TABLE `cash` DISABLE KEYS */;
INSERT INTO `cash` VALUES (1,'提供服务','20150203','',11,NULL,NULL,'600102',0,0,0,1,'2015-05-12 07:28:38',1431415718),(2,'国家金库上海市奉贤区支库','20150420','个税',1151,NULL,NULL,'222101',0,0,0,1,'2015-06-07 05:44:14',1433655854),(3,'--','20150421','手续费',36,NULL,NULL,'660301',0,0,0,1,'2015-06-07 05:44:14',1433655854),(4,'ttt','20150409','123',12,NULL,NULL,'660301',1001,0,0,1,'2015-06-07 05:46:03',1433655963);
/*!40000 ALTER TABLE `cash` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `client`
--

DROP TABLE IF EXISTS `client`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `client` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `company` varchar(256) NOT NULL,
  `vat` varchar(45) DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `add` varchar(100) DEFAULT NULL,
  `memo` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `client`
--

LOCK TABLES `client` WRITE;
/*!40000 ALTER TABLE `client` DISABLE KEYS */;
/*!40000 ALTER TABLE `client` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Temporary table structure for view `condomdate`
--

DROP TABLE IF EXISTS `condomdate`;
/*!50001 DROP VIEW IF EXISTS `condomdate`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
/*!50001 CREATE TABLE `condomdate` (
  `date` tinyint NOT NULL
) ENGINE=MyISAM */;
SET character_set_client = @saved_cs_client;

--
-- Table structure for table `department`
--

DROP TABLE IF EXISTS `department`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `department` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) DEFAULT NULL,
  `type` int(11) NOT NULL COMMENT '1\\2\\3\\4 为生产部门、管理部门、销售部门 、研发部门',
  `memo` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `department`
--

LOCK TABLES `department` WRITE;
/*!40000 ALTER TABLE `department` DISABLE KEYS */;
INSERT INTO `department` VALUES (1,'研发部',4,'研发部'),(2,'生产厂区部门',1,''),(3,'行政管理',2,''),(4,'销售人员部门',3,'');
/*!40000 ALTER TABLE `department` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `employee`
--

DROP TABLE IF EXISTS `employee`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `employee` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) DEFAULT NULL,
  `memo` varchar(200) DEFAULT NULL,
  `department_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `employee`
--

LOCK TABLES `employee` WRITE;
/*!40000 ALTER TABLE `employee` DISABLE KEYS */;
INSERT INTO `employee` VALUES (1,'张三','',2),(2,'李四',NULL,3),(3,'bb',NULL,1),(4,'bb',NULL,3),(5,'朱筠',NULL,3),(6,'朱筠',NULL,1);
/*!40000 ALTER TABLE `employee` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `meta`
--

DROP TABLE IF EXISTS `meta`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `meta` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `option` varchar(32) CHARACTER SET utf8 NOT NULL COMMENT '属性名称',
  `value` varchar(256) CHARACTER SET utf8 NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `meta`
--

LOCK TABLES `meta` WRITE;
/*!40000 ALTER TABLE `meta` DISABLE KEYS */;
INSERT INTO `meta` VALUES (1,'transitionDate','201401');
/*!40000 ALTER TABLE `meta` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `options`
--

DROP TABLE IF EXISTS `options`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `options` (
  `id` int(11) NOT NULL,
  `name` varchar(100) DEFAULT NULL,
  `support` varchar(100) DEFAULT NULL,
  `url` varchar(100) DEFAULT NULL,
  `entrynum` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `options`
--

LOCK TABLES `options` WRITE;
/*!40000 ALTER TABLE `options` DISABLE KEYS */;
INSERT INTO `options` VALUES (1,'我嘉',NULL,NULL,NULL);
/*!40000 ALTER TABLE `options` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `post`
--

DROP TABLE IF EXISTS `post`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `post` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `subject_id` int(11) NOT NULL,
  `year` int(11) NOT NULL,
  `month` int(11) NOT NULL,
  `balance` double NOT NULL,
  `posted` tinyint(1) NOT NULL DEFAULT '0',
  `debit` double NOT NULL DEFAULT '0' COMMENT '借',
  `credit` double NOT NULL DEFAULT '0' COMMENT '贷',
  `post_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `fk_subject_id_idx` (`subject_id`),
  CONSTRAINT `fk_subject_id` FOREIGN KEY (`subject_id`) REFERENCES `subjects` (`sbj_number`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=348 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `post`
--

LOCK TABLES `post` WRITE;
/*!40000 ALTER TABLE `post` DISABLE KEYS */;
INSERT INTO `post` VALUES (285,660102,2015,2,-54000,1,1800,55800,'2015-01-31 16:00:00'),(286,100201,2015,2,8500,1,10800,2300,'2015-01-31 16:00:00'),(287,660206,2015,2,-15000,1,500,15500,'2015-01-31 16:00:00'),(288,224101,2015,2,800,1,0,800,'2015-01-31 16:00:00'),(289,4001,2015,2,10000,1,0,10000,'2015-01-31 16:00:00'),(290,4103,2015,2,-71300,1,0,-71300,'2015-01-31 16:00:00'),(333,660301,2015,3,0,1,4.4,4.4,'2015-02-28 16:00:00'),(334,100201,2015,3,85666.76,1,110010.16,32843.4,'2015-02-28 16:00:00'),(335,660102,2015,3,0,1,2320,2320,'2015-02-28 16:00:00'),(336,660206,2015,3,0,1,5900,5900,'2015-02-28 16:00:00'),(337,660210,2015,3,0,1,68,68,'2015-02-28 16:00:00'),(338,4001,2015,3,120000,1,0,110000,'2015-02-28 16:00:00'),(339,660302,2015,3,0,1,-10.02,-10.02,'2015-02-28 16:00:00'),(340,660212,2015,3,0,1,346,346,'2015-02-28 16:00:00'),(341,6301,2015,3,0,1,0.14,0.14,'2015-02-28 16:00:00'),(342,160101,2015,3,9195,1,9195,0,'2015-02-28 16:00:00'),(343,222101,2015,3,-10005,1,10005,0,'2015-02-28 16:00:00'),(344,122103,2015,3,5000,1,5000,0,'2015-02-28 16:00:00'),(345,122102,2015,3,5,1,5,0,'2015-02-28 16:00:00'),(346,224101,2015,3,800,1,0,0,'2015-02-28 16:00:00'),(347,4103,2015,3,-79928.24,1,0,-8628.24,'2015-02-28 16:00:00');
/*!40000 ALTER TABLE `post` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `project`
--

DROP TABLE IF EXISTS `project`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `project` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(60) DEFAULT NULL,
  `memo` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `project`
--

LOCK TABLES `project` WRITE;
/*!40000 ALTER TABLE `project` DISABLE KEYS */;
/*!40000 ALTER TABLE `project` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `subjects`
--

DROP TABLE IF EXISTS `subjects`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `subjects` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `sbj_number` int(12) NOT NULL DEFAULT '0',
  `sbj_name` varchar(20) DEFAULT NULL,
  `sbj_cat` varchar(100) DEFAULT NULL COMMENT '1:资产类; 2:负债类; 3:权益类; 4:收入类; 5:费用类',
  `sbj_table` varchar(200) DEFAULT NULL,
  `has_sub` tinyint(1) NOT NULL DEFAULT '0',
  `balance_set` tinyint(1) NOT NULL DEFAULT '0',
  `start_balance` double DEFAULT '0',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  UNIQUE KEY `No` (`sbj_number`)
) ENGINE=InnoDB AUTO_INCREMENT=527 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `subjects`
--

LOCK TABLES `subjects` WRITE;
/*!40000 ALTER TABLE `subjects` DISABLE KEYS */;
INSERT INTO `subjects` VALUES (23,1001,'库存现金','1',NULL,0,1,0),(24,1002,'银行存款','1',NULL,1,1,0),(25,1003,'存放中央银行款项','1',NULL,0,1,0),(26,1102,'短期投资跌价准备','1',NULL,0,1,0),(27,1021,'结算备付金','1',NULL,0,1,0),(28,1031,'存出保证金','1',NULL,0,1,0),(29,1101,'交易性金融资产','1',NULL,1,1,0),(30,1111,'买入返售金融资产','1',NULL,0,1,0),(31,1121,'应收票据','1',NULL,0,1,0),(32,1122,'应收账款','1',NULL,0,1,0),(33,1123,'预付账款','1',NULL,0,1,0),(34,1131,'应收股利','1',NULL,0,1,0),(35,1132,'应收利息','1',NULL,0,1,0),(36,1201,'应收代位追偿款','1',NULL,0,1,0),(37,1211,'应收分保账款','1',NULL,0,1,0),(38,1212,'应收分保合同准备金','1',NULL,0,1,0),(39,1221,'其他应收款','1',NULL,1,1,0),(40,1231,'坏账准备','1',NULL,0,1,0),(41,1301,'贴现资产','1',NULL,0,1,0),(42,1302,'拆出资金','1',NULL,0,1,0),(43,1303,'贷款','1',NULL,0,1,0),(44,1304,'贷款损失准备','1',NULL,0,1,0),(45,1311,'代理兑付证券','1',NULL,0,1,0),(46,1321,'代理业务资产','1',NULL,0,1,0),(47,1401,'材料采购','1',NULL,0,1,0),(48,1402,'在途物资','1',NULL,0,1,0),(49,1403,'原材料','1',NULL,0,1,0),(50,1404,'材料成本差异','1',NULL,0,1,0),(51,1405,'库存商品','1',NULL,0,1,0),(52,1406,'发出商品','1',NULL,0,1,0),(53,1407,'商品进销差价','1',NULL,0,1,0),(54,1408,'委托加工物资','1',NULL,0,1,0),(55,1411,'周转材料','1',NULL,0,1,0),(56,1412,'包装物及低值易耗品','1',NULL,0,1,0),(57,1421,'消耗性生物资产','1',NULL,0,1,0),(58,1431,'贵金属','1',NULL,0,1,0),(59,1441,'抵债资产','1',NULL,0,1,0),(60,1451,'损余物资','1',NULL,0,1,0),(61,1461,'融资租赁资产','1',NULL,0,1,0),(62,1471,'存货跌价准备','1',NULL,0,1,0),(63,1501,'持有至到期投资','1',NULL,0,1,0),(64,1502,'持有至到期投资减值准备','1',NULL,0,1,0),(65,1503,'可供出售金融资产','1',NULL,0,1,0),(66,1511,'长期股权投资','1',NULL,1,1,0),(67,1512,'长期股权投资减值准备','1',NULL,0,1,0),(68,1521,'投资性房地产','1',NULL,0,1,0),(69,1531,'长期应收款','1',NULL,0,1,0),(70,1532,'未实现融资收益','1',NULL,0,1,0),(71,1541,'存出资本保证金','1',NULL,0,1,0),(72,1601,'固定资产','1',NULL,1,1,0),(73,1602,'累计折旧','1',NULL,0,1,0),(74,1603,'固定资产减值准备','1',NULL,0,1,0),(75,1604,'在建工程','1',NULL,0,1,0),(76,1605,'工程物资','1',NULL,0,1,0),(77,1606,'固定资产清理','1',NULL,0,1,0),(78,1611,'未担保余值','1',NULL,0,1,0),(79,1621,'生产性生物资产','1',NULL,0,1,0),(80,1622,'生产性生物资产累计折旧','1',NULL,0,1,0),(81,1623,'公益性生物资产','1',NULL,0,1,0),(82,1631,'油气资产','1',NULL,0,1,0),(83,1632,'累计折耗','1',NULL,0,1,0),(84,1701,'无形资产','1',NULL,0,1,0),(85,1702,'累计摊销','1',NULL,0,1,0),(86,1703,'无形资产减值准备','1',NULL,0,1,0),(87,1711,'商誉','1',NULL,0,1,0),(88,1801,'长期待摊费用','1',NULL,0,1,0),(89,1811,'递延所得税资产','1',NULL,0,1,0),(90,1821,'独立账户资产','1',NULL,0,1,0),(91,1901,'待处理财产损溢','1',NULL,0,1,0),(228,2001,'短期借款','2',NULL,1,1,0),(229,2002,'存入保证金','2',NULL,0,1,0),(230,2003,'拆入资金','2',NULL,0,1,0),(231,2004,'向中央银行借款','2',NULL,0,1,0),(232,2011,'吸收存款','2',NULL,0,1,0),(233,2012,'同业存放','2',NULL,0,1,0),(234,2021,'贴现负债','2',NULL,0,1,0),(235,2101,'交易性金融负债','2',NULL,0,1,0),(276,2111,'卖出回购金融资产款金','2',NULL,0,1,0),(277,2201,'应付票据','2',NULL,0,1,0),(278,2202,'应付账款','2',NULL,0,1,0),(279,2203,'预收账款','2',NULL,1,1,0),(280,2211,'应付职工薪酬','2',NULL,0,1,0),(281,2221,'应交税费','2',NULL,1,1,0),(282,2231,'应付利息','2',NULL,0,1,0),(283,2232,'应付股利','2',NULL,1,1,0),(284,2241,'其他应付款','2',NULL,1,1,0),(285,2251,'应付保单红利','2',NULL,0,1,0),(286,2261,'应付分保账款','2',NULL,0,1,0),(287,2311,'代理买卖证券款','2',NULL,0,1,0),(288,2312,'代理承销证券款','2',NULL,0,1,0),(289,2313,'代理兑付证券款','2',NULL,0,1,0),(290,2314,'代理业务负债','2',NULL,0,1,0),(291,2401,'递延收益','2',NULL,0,1,0),(292,2501,'长期借款','2',NULL,0,1,0),(293,2502,'应付债券','2',NULL,0,1,0),(294,2601,'未到期责任准备金','2',NULL,0,1,0),(295,2602,'保险责任准备金','2',NULL,0,1,0),(296,2611,'保户储金','2',NULL,0,1,0),(297,2621,'独立账户负债','2',NULL,0,1,0),(298,2701,'长期应付款','2',NULL,0,1,0),(299,2702,'未确认融资费用','2',NULL,0,1,0),(300,2711,'专项应付款','2',NULL,0,1,0),(301,2801,'预计负债','2',NULL,0,1,0),(302,2901,'递延所得税负债','2',NULL,0,1,0),(303,4001,'实收资本','3',NULL,0,1,0),(304,4002,'资本公积','3',NULL,0,1,0),(305,4101,'盈余公积','3',NULL,0,1,0),(306,4102,'一般风险准备','3',NULL,0,1,0),(307,4103,'本年利润','3',NULL,0,1,0),(308,4104,'利润分配','3',NULL,0,1,0),(309,4201,'库存股','3',NULL,0,1,0),(310,6001,'主营业务收入','4',NULL,1,1,0),(311,6011,'利息收入','4',NULL,0,1,0),(312,6021,'手续费及佣金收入','4',NULL,0,1,0),(313,6031,'保费收入','4',NULL,0,1,0),(314,6041,'租赁收入','4',NULL,0,1,0),(315,6051,'其他业务收入','4',NULL,1,1,0),(316,6061,'汇兑损益','4',NULL,0,1,0),(317,6101,'公允价值变动损益','4',NULL,0,1,0),(318,6111,'投资收益','4',NULL,1,1,0),(319,6201,'摊回保险责任准备金','4',NULL,0,1,0),(320,6202,'摊回赔付支出','4',NULL,0,1,0),(321,6203,'摊回分保费用','4',NULL,0,1,0),(322,6301,'营业外收入','4',NULL,0,1,0),(323,6401,'主营业务成本','5',NULL,1,1,0),(324,6402,'其他业务支出','5',NULL,1,1,0),(325,6403,'营业税金及附加','5',NULL,1,1,0),(326,6411,'利息支出','5',NULL,0,1,0),(327,6421,'手续费及佣金支出','5',NULL,0,1,0),(328,6501,'提取未到期责任准备金','5',NULL,0,1,0),(329,6502,'提取保险责任准备金','5',NULL,0,1,0),(330,6511,'赔付支出','5',NULL,0,1,0),(331,6521,'保户红利支出','5',NULL,0,1,0),(332,6531,'退保金','5',NULL,0,1,0),(333,6541,'分出保费','5',NULL,0,1,0),(334,6542,'分保费用','5',NULL,0,1,0),(335,6601,'销售费用','5',NULL,1,1,0),(336,6602,'管理费用','5',NULL,1,1,0),(337,6603,'财务费用','5',NULL,1,1,0),(338,6604,'勘探费用','5',NULL,0,1,0),(339,6701,'资产减值损失','5',NULL,0,1,0),(340,6711,'营业外支出','5',NULL,0,1,0),(341,6801,'所得税费用','5',NULL,0,1,0),(342,6901,'以前年度损益调整','5',NULL,0,1,0),(405,660201,'工资','5',NULL,0,0,0),(406,640101,'工资','5',NULL,0,0,0),(420,160101,'电子设备','1',NULL,0,0,0),(421,160102,'办公设备','1',NULL,0,0,0),(422,160103,'运输设备','1',NULL,0,0,0),(423,160104,'生产设备','1',NULL,0,0,0),(425,660202,'研发费','5',NULL,1,0,0),(428,660102,'办公费','5',NULL,0,0,0),(432,110101,'股票','1',NULL,0,0,0),(433,110102,'基金','1',NULL,0,0,0),(434,110103,'债券','1',NULL,0,0,0),(435,660301,'手续费','5',NULL,0,0,0),(436,640201,'材料销售','5',NULL,0,0,0),(437,640202,'技术转让','5',NULL,0,0,0),(438,640203,'固定资产租赁','5',NULL,0,0,0),(444,660302,'利息费用','5',NULL,0,0,0),(445,605101,'材料销售','4',NULL,0,0,0),(446,605102,'技术转让','4',NULL,0,0,0),(447,222101,'增值税','2',NULL,0,0,0),(463,110104,'其他','1',NULL,0,0,0),(464,660204,'招待费','5',NULL,0,0,0),(471,640102,'社保','5',NULL,0,0,0),(478,660103,'社保','5',NULL,0,0,0),(481,640103,'工资与奖金','5',NULL,0,0,0),(482,640104,'社保公积金','5',NULL,0,0,0),(483,200101,'中国银行','2',NULL,0,0,0),(484,200102,'招商银行','2',NULL,0,0,0),(485,200103,'农业银行','2',NULL,0,0,0),(486,200104,'建设银行','2',NULL,0,0,0),(487,200105,'工商银行','2',NULL,0,0,0),(488,600101,'销售产品','4',NULL,0,0,0),(489,600102,'提供服务','4',NULL,0,0,0),(490,611101,'股票','4',NULL,0,0,0),(491,611102,'基金','4',NULL,0,0,0),(492,611103,'债券','4',NULL,0,0,0),(493,611104,'其他','4',NULL,0,0,0),(495,66020201,'工资与奖金','5',NULL,0,0,0),(496,660205,'工资与奖金','5',NULL,0,0,0),(498,660104,'工资与奖金','5',NULL,0,0,0),(500,660206,'服务费','5',NULL,0,0,0),(503,122101,'a公司','1',NULL,0,0,0),(504,122102,'b公司','1',NULL,0,0,0),(505,223201,'bb公司','2',NULL,0,0,0),(506,224101,'b公司','2',NULL,0,0,0),(507,151101,'a公司','1',NULL,0,0,0),(508,611105,'a公司','4',NULL,0,0,0),(511,660207,'印花税','5',NULL,0,0,0),(512,660208,'社保公积金','5',NULL,0,0,0),(513,66020202,'社保公积金','5',NULL,0,0,0),(514,660209,'交通费','5',NULL,0,0,0),(515,660210,'test','5',NULL,0,0,0),(516,660211,'快递费','5',NULL,0,0,0),(517,660212,'差旅费','5',NULL,0,0,0),(518,100201,'中国银行','1',NULL,0,0,0),(519,100202,'工商银行','1',NULL,0,0,0),(520,100203,'交通银行','1',NULL,0,0,0),(521,122103,'押金','1',NULL,0,0,0),(522,122104,'--','1',NULL,0,0,0),(523,640301,'城建税','5',NULL,0,0,0),(524,640302,'教育费附加','5',NULL,0,0,0),(525,640303,'河道管理费','5',NULL,0,0,0),(526,640304,'营业税','5',NULL,0,0,0);
/*!40000 ALTER TABLE `subjects` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `transition`
--

DROP TABLE IF EXISTS `transition`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `transition` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `entry_num_prefix` varchar(10) DEFAULT NULL,
  `entry_num` int(11) NOT NULL,
  `entry_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '录入时间',
  `entry_date` timestamp NULL DEFAULT NULL COMMENT '凭证日期，非录入时间',
  `entry_name` varchar(512) NOT NULL COMMENT '交易方名称',
  `data_type` tinyint(4) NOT NULL COMMENT '类型1：银行,2：现金',
  `data_id` int(11) NOT NULL COMMENT '原始数据ID',
  `entry_memo` varchar(512) CHARACTER SET utf8 COLLATE utf8_swedish_ci DEFAULT NULL,
  `entry_transaction` tinyint(1) NOT NULL DEFAULT '1' COMMENT '1:借;2:贷',
  `entry_subject` int(11) NOT NULL,
  `entry_amount` decimal(12,2) NOT NULL,
  `entry_appendix` text COMMENT '已废弃不用',
  `entry_appendix_type` tinyint(1) DEFAULT NULL COMMENT '1:client;2:vendor;3:employee;4:project',
  `entry_appendix_id` int(8) DEFAULT NULL COMMENT 'client vendor employee project ID',
  `entry_creater` int(11) NOT NULL,
  `entry_editor` int(11) NOT NULL,
  `entry_reviewer` int(11) NOT NULL,
  `entry_deleted` tinyint(1) NOT NULL DEFAULT '0',
  `entry_reviewed` tinyint(1) NOT NULL DEFAULT '0',
  `entry_posting` tinyint(1) unsigned NOT NULL DEFAULT '0',
  `entry_settlement` tinyint(4) NOT NULL DEFAULT '0' COMMENT '0:不是结转凭证;1:是结转凭证',
  `entry_closing` tinyint(1) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `subject_id_idx` (`entry_subject`),
  KEY `re_employee_id_idx` (`entry_reviewer`),
  KEY `ed_employee_id_idx` (`entry_editor`),
  CONSTRAINT `transition_ibfk_1` FOREIGN KEY (`entry_subject`) REFERENCES `subjects` (`sbj_number`)
) ENGINE=InnoDB AUTO_INCREMENT=934 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `transition`
--

LOCK TABLES `transition` WRITE;
/*!40000 ALTER TABLE `transition` DISABLE KEYS */;
INSERT INTO `transition` VALUES (519,'201502',1,'2015-05-22 05:57:23','2015-02-24 16:00:00','上海市数字证书认证中心有限公司',1,374,'企业证书费用',1,660102,300.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(520,'201502',1,'2015-05-22 05:57:23','2015-02-24 16:00:00','上海市数字证书认证中心有限公司',1,374,'企业证书费用',2,100201,300.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(521,'201502',2,'2015-05-22 05:57:23','2015-02-24 16:00:00','',1,375,'服务费',1,660206,500.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(522,'201502',2,'2015-05-22 05:57:23','2015-02-24 16:00:00','',1,375,'服务费',2,100201,500.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(523,'201502',3,'2015-05-22 05:57:23','2015-02-24 16:00:00','b公司',1,376,'借款',2,224101,800.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(524,'201502',3,'2015-05-22 05:57:23','2015-02-24 16:00:00','b公司',1,376,'借款',1,100201,800.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(525,'201502',4,'2015-05-22 05:57:23','2015-02-26 16:00:00','重庆猪八戒网络有限公司',1,377,'圈圈橙的文字商标注册费用',1,660102,1500.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(526,'201502',4,'2015-05-22 05:57:23','2015-02-26 16:00:00','重庆猪八戒网络有限公司',1,377,'圈圈橙的文字商标注册费用',2,100201,1500.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(527,'201502',5,'2015-05-22 05:57:23','2015-02-26 16:00:00','朱筠',1,378,'投资款',2,4001,10000.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(528,'201502',5,'2015-05-22 05:57:23','2015-02-26 16:00:00','朱筠',1,378,'投资款',1,100201,10000.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(529,'201502',6,'2015-05-22 06:01:04','2015-02-28 15:59:59','',0,0,'结转凭证',2,660102,1800.00,NULL,NULL,NULL,52,52,48,0,1,1,1,1),(530,'201502',6,'2015-05-22 06:01:04','2015-02-28 15:59:59','',0,0,'结转凭证',2,660206,500.00,NULL,NULL,NULL,52,52,48,0,1,1,1,1),(531,'201502',6,'2015-05-22 06:01:04','2015-02-28 15:59:59','',0,0,'结转凭证',2,4103,-2300.00,NULL,NULL,NULL,52,52,48,0,1,1,1,1),(532,'201503',1,'2015-05-22 06:11:25','2015-03-01 16:00:00','',1,379,'手续费',1,660301,4.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(533,'201503',1,'2015-05-22 06:11:25','2015-03-01 16:00:00','',1,379,'手续费',2,100201,4.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(534,'201503',2,'2015-05-22 06:11:25','2015-03-01 16:00:00','',1,380,'手续费',1,660301,0.40,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(535,'201503',2,'2015-05-22 06:11:25','2015-03-01 16:00:00','',1,380,'手续费',2,100201,0.40,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(536,'201503',3,'2015-05-22 06:11:25','2015-03-03 16:00:00','朱筠',1,381,'上海银行基本账户开户费用',1,660102,800.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(537,'201503',3,'2015-05-22 06:11:25','2015-03-03 16:00:00','朱筠',1,381,'上海银行基本账户开户费用',2,100201,800.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(538,'201503',4,'2015-05-22 06:11:25','2015-03-03 16:00:00','朱筠',1,382,'亿美软通短信通道服务费',1,660206,5000.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(539,'201503',4,'2015-05-22 06:11:25','2015-03-03 16:00:00','朱筠',1,382,'亿美软通短信通道服务费',2,100201,5000.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(540,'201503',5,'2015-05-22 06:11:25','2015-03-03 16:00:00','朱筠',1,383,'阿里云服务器租赁年费',1,660210,68.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(541,'201503',5,'2015-05-22 06:11:25','2015-03-03 16:00:00','朱筠',1,383,'阿里云服务器租赁年费',2,100201,68.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(542,'201503',6,'2015-05-22 06:11:25','2015-03-03 16:00:00','朱筠',1,384,'公司注册费用',1,660102,500.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(543,'201503',6,'2015-05-22 06:11:25','2015-03-03 16:00:00','朱筠',1,384,'公司注册费用',2,100201,500.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(544,'201503',7,'2015-05-22 06:11:25','2015-03-03 16:00:00','朱筠',1,385,'朱筠投资款',2,4001,10000.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(545,'201503',7,'2015-05-22 06:11:25','2015-03-03 16:00:00','朱筠',1,385,'朱筠投资款',1,100201,10000.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(546,'201503',8,'2015-05-22 06:11:25','2015-03-03 16:00:00','老法师（上海）财务咨询有限公司',1,386,'3个月财务代理费用',1,660206,900.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(547,'201503',8,'2015-05-22 06:11:25','2015-03-03 16:00:00','老法师（上海）财务咨询有限公司',1,386,'3个月财务代理费用',2,100201,900.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(548,'201503',9,'2015-05-22 06:11:25','2015-03-14 16:00:00','陆晓峰',1,387,'注资',2,4001,50000.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(549,'201503',9,'2015-05-22 06:11:26','2015-03-14 16:00:00','陆晓峰',1,387,'注资',1,100201,50000.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(550,'201503',10,'2015-05-22 06:11:26','2015-03-15 16:00:00','朱筠',1,388,'税务盘购买',1,660102,1020.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(551,'201503',10,'2015-05-22 06:11:26','2015-03-15 16:00:00','朱筠',1,388,'税务盘购买',2,100201,1020.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(552,'201503',11,'2015-05-22 06:11:26','2015-03-19 16:00:00','',1,389,'利息收入',1,660302,-10.02,NULL,NULL,0,52,52,48,0,1,1,0,1),(553,'201503',11,'2015-05-22 06:11:26','2015-03-19 16:00:00','',1,389,'利息收入',1,100201,10.02,NULL,NULL,0,52,52,48,0,1,1,0,1),(554,'201503',12,'2015-05-22 06:11:26','2015-03-29 16:00:00','朱筠',1,390,'差旅费',1,660212,346.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(555,'201503',12,'2015-05-22 06:11:26','2015-03-29 16:00:00','朱筠',1,390,'差旅费',2,100201,346.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(556,'201503',13,'2015-05-22 06:11:26','2015-03-30 16:00:00','顾雨婷',1,391,'微信收入',2,6301,0.13,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(557,'201503',13,'2015-05-22 06:11:26','2015-03-30 16:00:00','顾雨婷',1,391,'微信收入',1,100201,0.13,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(558,'201503',14,'2015-05-22 06:11:26','2015-03-30 16:00:00','朱筠',1,392,'朱筠的第二笔投资款',2,4001,50000.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(559,'201503',14,'2015-05-22 06:11:26','2015-03-30 16:00:00','朱筠',1,392,'朱筠的第二笔投资款',1,100201,50000.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(560,'201503',15,'2015-05-22 06:11:26','2015-03-30 16:00:00','朱筠',1,393,'电脑购买',1,160101,9195.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(561,'201503',15,'2015-05-22 06:11:26','2015-03-30 16:00:00','朱筠',1,393,'电脑购买',2,100201,9195.00,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(562,'201503',16,'2015-05-22 06:11:26','2015-03-30 16:00:00','深圳市腾讯计算机系统有限公司',1,394,'微信收入',2,6301,0.01,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(563,'201503',16,'2015-05-22 06:11:26','2015-03-30 16:00:00','深圳市腾讯计算机系统有限公司',1,394,'微信收入',1,100201,0.01,NULL,NULL,NULL,52,52,48,0,1,1,0,1),(564,'201502',7,'2015-05-22 06:18:21','2015-02-28 15:59:59','',0,0,'结转凭证',2,660102,3600.00,NULL,NULL,NULL,52,52,48,0,1,1,1,1),(565,'201502',7,'2015-05-22 06:18:21','2015-02-28 15:59:59','',0,0,'结转凭证',2,660206,1000.00,NULL,NULL,NULL,52,52,48,0,1,1,1,1),(566,'201502',7,'2015-05-22 06:18:21','2015-02-28 15:59:59','',0,0,'结转凭证',2,4103,-4600.00,NULL,NULL,NULL,52,52,48,0,1,1,1,1),(673,'201504',1,'2015-05-25 07:07:23','2015-04-19 16:00:00','国家金库上海市奉贤区支库',1,441,'个税',0,222101,1150.00,NULL,NULL,NULL,1,1,0,0,0,0,0,0),(674,'201504',1,'2015-05-25 07:07:23','2015-04-19 16:00:00','国家金库上海市奉贤区支库',1,441,'个税',1,100201,1150.00,NULL,NULL,NULL,1,1,0,0,0,0,0,0),(676,'201504',2,'2015-05-25 07:16:51','2015-04-19 16:00:00','国家金库上海市奉贤区支库',1,458,'个税',2,222101,1150.00,NULL,NULL,NULL,1,1,0,0,0,0,0,0),(677,'201504',2,'2015-05-25 07:16:51','2015-04-19 16:00:00','国家金库上海市奉贤区支库',1,458,'个税',1,100201,1150.00,NULL,NULL,NULL,1,1,0,0,0,0,0,0),(708,'201503',17,'2015-05-25 07:23:29','2015-02-28 16:00:00','a公司',1,474,'项目转账',1,222101,5000.00,NULL,NULL,NULL,1,1,48,0,1,1,0,1),(709,'201503',17,'2015-05-25 07:23:29','2015-02-28 16:00:00','a公司',1,474,'项目转账',2,100201,5000.00,NULL,NULL,NULL,1,1,48,0,1,1,0,1),(710,'201503',18,'2015-05-25 07:23:29','2015-02-28 16:00:00','押金',1,475,'项目转账',1,122103,5000.00,NULL,NULL,NULL,1,1,48,0,1,1,0,1),(711,'201503',18,'2015-05-25 07:23:29','2015-02-28 16:00:00','押金',1,475,'项目转账',2,100201,5000.00,NULL,NULL,NULL,1,1,48,0,1,1,0,1),(712,'201503',19,'2015-05-25 07:24:45','2015-03-01 16:00:00','',1,476,'项目转账',1,222101,5.00,NULL,NULL,NULL,1,1,48,0,1,1,0,1),(713,'201503',19,'2015-05-25 07:24:45','2015-03-01 16:00:00','',1,476,'项目转账',2,100201,5.00,NULL,NULL,NULL,1,1,48,0,1,1,0,1),(714,'201503',20,'2015-05-25 07:24:45','2015-03-01 16:00:00','b公司',1,477,'项目转账',1,122102,5.00,NULL,NULL,NULL,1,1,48,0,1,1,0,1),(715,'201503',20,'2015-05-25 07:24:45','2015-03-01 16:00:00','b公司',1,477,'项目转账',2,100201,5.00,NULL,NULL,NULL,1,1,48,0,1,1,0,1),(716,'201503',21,'2015-05-25 07:26:40','2015-02-28 16:00:00','某某某公司',1,478,'项目转账',1,222101,5000.00,NULL,NULL,NULL,1,1,48,0,1,1,0,1),(717,'201503',21,'2015-05-25 07:26:40','2015-02-28 16:00:00','某某某公司',1,478,'项目转账',2,100201,5000.00,NULL,NULL,NULL,1,1,48,0,1,1,0,1),(828,'201504',3,'2015-05-25 08:56:16','2015-04-14 16:00:00','董凌虹',1,534,'备用金',1,1001,50000.00,NULL,NULL,NULL,1,1,0,0,0,0,0,0),(829,'201504',3,'2015-05-25 08:56:16','2015-04-14 16:00:00','董凌虹',1,534,'备用金',2,100201,50000.00,NULL,NULL,NULL,1,1,0,0,0,0,0,0),(830,'201504',4,'2015-05-25 08:56:16','2015-04-19 16:00:00','国家金库上海市奉贤区支库',1,535,'个税',1,222101,1150.00,NULL,NULL,NULL,1,1,0,0,0,0,0,0),(831,'201504',4,'2015-05-25 08:56:16','2015-04-19 16:00:00','国家金库上海市奉贤区支库',1,535,'个税',2,100201,1150.00,NULL,NULL,NULL,1,1,0,0,0,0,0,0),(832,'201504',5,'2015-05-25 08:56:16','2015-04-20 16:00:00','--',1,536,'手续费',1,222101,35.00,NULL,NULL,NULL,1,1,0,0,0,0,0,0),(833,'201504',5,'2015-05-25 08:56:16','2015-04-20 16:00:00','--',1,536,'手续费',2,100201,35.00,NULL,NULL,NULL,1,1,0,0,0,0,0,0),(834,'201504',6,'2015-05-25 08:56:17','2015-04-22 16:00:00','上海市公积金管理中心（静安支行）',1,537,'公积金',1,222101,3360.00,NULL,NULL,NULL,1,1,0,0,0,0,0,0),(835,'201504',6,'2015-05-25 08:56:17','2015-04-22 16:00:00','上海市公积金管理中心（静安支行）',1,537,'公积金',2,100201,3360.00,NULL,NULL,NULL,1,1,0,0,0,0,0,0),(836,'201504',7,'2015-05-25 08:56:17','2015-04-27 16:00:00','--',1,538,'手续费',1,222101,1.00,NULL,NULL,NULL,1,1,0,0,0,0,0,0),(837,'201504',7,'2015-05-25 08:56:17','2015-04-27 16:00:00','--',1,538,'手续费',2,100201,1.00,NULL,NULL,NULL,1,1,0,0,0,0,0,0),(838,'201504',8,'2015-05-25 08:56:17','2015-04-28 16:00:00','阳君',1,539,'工资奖金收入',1,222101,3300.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(839,'201504',8,'2015-05-25 08:56:17','2015-04-28 16:00:00','阳君',1,539,'工资奖金收入',2,100201,3300.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(840,'201504',9,'2015-05-25 08:56:17','2015-04-28 16:00:00','赵新伟',1,540,'工资奖金收入',1,222101,3300.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(841,'201504',9,'2015-05-25 08:56:17','2015-04-28 16:00:00','赵新伟',1,540,'工资奖金收入',2,100201,3300.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(842,'201504',10,'2015-05-25 08:56:17','2015-04-28 16:00:00','嵇正超',1,541,'工资奖金收入',1,222101,3300.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(843,'201504',10,'2015-05-25 08:56:17','2015-04-28 16:00:00','嵇正超',1,541,'工资奖金收入',2,100201,3300.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(844,'201504',11,'2015-05-25 08:56:17','2015-04-28 16:00:00','陈一菠',1,542,'工资奖金收入',1,222101,354.55,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(845,'201504',11,'2015-05-25 08:56:17','2015-04-28 16:00:00','陈一菠',1,542,'工资奖金收入',2,100201,354.55,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(846,'201504',12,'2015-05-25 08:56:17','2015-04-28 16:00:00','张丹洁',1,543,'工资奖金收入',1,222101,3300.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(847,'201504',12,'2015-05-25 08:56:17','2015-04-28 16:00:00','张丹洁',1,543,'工资奖金收入',2,100201,3300.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(848,'201504',13,'2015-05-25 08:56:17','2015-04-28 16:00:00','杨润华',1,544,'工资奖金收入',1,222101,3300.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(849,'201504',13,'2015-05-25 08:56:17','2015-04-28 16:00:00','杨润华',1,544,'工资奖金收入',2,100201,3300.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(850,'201504',14,'2015-05-25 08:56:17','2015-04-28 16:00:00','李旭辉',1,545,'工资奖金收入',1,222101,3300.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(851,'201504',14,'2015-05-25 08:56:17','2015-04-28 16:00:00','李旭辉',1,545,'工资奖金收入',2,100201,3300.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(852,'201504',15,'2015-05-25 08:56:17','2015-04-28 16:00:00','易超',1,546,'工资奖金收入',1,222101,3445.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(853,'201504',15,'2015-05-25 08:56:17','2015-04-28 16:00:00','易超',1,546,'工资奖金收入',2,100201,3445.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(854,'201504',16,'2015-05-25 08:56:17','2015-04-28 16:00:00','张志辉',1,547,'工资奖金收入',1,222101,3506.62,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(855,'201504',16,'2015-05-25 08:56:17','2015-04-28 16:00:00','张志辉',1,547,'工资奖金收入',2,100201,3506.62,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(856,'201504',17,'2015-05-25 08:56:17','2015-04-28 16:00:00','褚魁',1,548,'工资奖金收入',1,222101,2825.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(857,'201504',17,'2015-05-25 08:56:17','2015-04-28 16:00:00','褚魁',1,548,'工资奖金收入',2,100201,2825.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(858,'201504',18,'2015-05-25 08:56:17','2015-04-28 16:00:00','施威',1,549,'工资奖金收入',1,222101,2256.82,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(859,'201504',18,'2015-05-25 08:56:17','2015-04-28 16:00:00','施威',1,549,'工资奖金收入',2,100201,2256.82,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(860,'201504',19,'2015-05-25 08:56:17','2015-04-28 16:00:00','陈军',1,550,'工资奖金收入',1,222101,1359.09,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(861,'201504',19,'2015-05-25 08:56:17','2015-04-28 16:00:00','陈军',1,550,'工资奖金收入',2,100201,1359.09,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(862,'201504',20,'2015-05-25 09:00:55','2015-04-14 16:00:00','董凌虹',1,551,'备用金',2,4001,50000.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(863,'201504',20,'2015-05-25 09:00:55','2015-04-14 16:00:00','董凌虹',1,551,'备用金',1,100201,50000.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(864,'201504',21,'2015-05-25 09:00:55','2015-04-19 16:00:00','国家金库上海市奉贤区支库',1,552,'个税',1,222101,1150.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(865,'201504',21,'2015-05-25 09:00:55','2015-04-19 16:00:00','国家金库上海市奉贤区支库',1,552,'个税',2,100201,1150.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(866,'201504',22,'2015-05-25 09:00:55','2015-04-20 16:00:00','--',1,553,'手续费',1,660301,35.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(867,'201504',22,'2015-05-25 09:00:55','2015-04-20 16:00:00','--',1,553,'手续费',2,100201,35.00,NULL,NULL,NULL,1,1,48,0,1,0,0,0),(868,'201502',8,'2015-05-29 02:16:53','2015-02-28 15:59:59','',0,0,'结转凭证',2,660102,7200.00,NULL,NULL,NULL,52,52,48,0,1,1,1,1),(869,'201502',8,'2015-05-29 02:16:53','2015-02-28 15:59:59','',0,0,'结转凭证',2,660206,2000.00,NULL,NULL,NULL,52,52,48,0,1,1,1,1),(870,'201502',8,'2015-05-29 02:16:53','2015-02-28 15:59:59','',0,0,'结转凭证',2,4103,-9200.00,NULL,NULL,NULL,52,52,48,0,1,1,1,1),(879,'201502',9,'2015-06-07 05:37:39','2015-02-28 15:59:59','',0,0,'结转凭证',2,660102,14400.00,NULL,NULL,NULL,1,1,48,0,1,1,1,1),(880,'201502',9,'2015-06-07 05:37:40','2015-02-28 15:59:59','',0,0,'结转凭证',2,660206,4000.00,NULL,NULL,NULL,1,1,48,0,1,1,1,1),(881,'201502',9,'2015-06-07 05:37:40','2015-02-28 15:59:59','',0,0,'结转凭证',2,4103,-18400.00,NULL,NULL,NULL,1,1,48,0,1,1,1,1),(890,'201502',10,'2015-06-07 05:39:15','2015-02-28 15:59:59','',0,0,'结转凭证',2,660102,28800.00,NULL,NULL,NULL,48,48,48,0,1,1,1,1),(891,'201502',10,'2015-06-07 05:39:15','2015-02-28 15:59:59','',0,0,'结转凭证',2,660206,8000.00,NULL,NULL,NULL,48,48,48,0,1,1,1,1),(892,'201502',10,'2015-06-07 05:39:15','2015-02-28 15:59:59','',0,0,'结转凭证',2,4103,-36800.00,NULL,NULL,NULL,48,48,48,0,1,1,1,1),(893,'201503',22,'2015-06-07 05:39:15','2015-03-31 15:59:59','',0,0,'结转凭证',1,6301,0.14,NULL,NULL,NULL,48,48,48,0,1,1,1,1),(894,'201503',22,'2015-06-07 05:39:15','2015-03-31 15:59:59','',0,0,'结转凭证',2,660102,2320.00,NULL,NULL,NULL,48,48,48,0,1,1,1,1),(895,'201503',22,'2015-06-07 05:39:15','2015-03-31 15:59:59','',0,0,'结转凭证',2,660301,4.40,NULL,NULL,NULL,48,48,48,0,1,1,1,1),(896,'201503',22,'2015-06-07 05:39:15','2015-03-31 15:59:59','',0,0,'结转凭证',2,660302,-10.02,NULL,NULL,NULL,48,48,48,0,1,1,1,1),(897,'201503',22,'2015-06-07 05:39:15','2015-03-31 15:59:59','',0,0,'结转凭证',2,660206,5900.00,NULL,NULL,NULL,48,48,48,0,1,1,1,1),(898,'201503',22,'2015-06-07 05:39:15','2015-03-31 15:59:59','',0,0,'结转凭证',2,660210,68.00,NULL,NULL,NULL,48,48,48,0,1,1,1,1),(899,'201503',22,'2015-06-07 05:39:15','2015-03-31 15:59:59','',0,0,'结转凭证',2,660212,346.00,NULL,NULL,NULL,48,48,48,0,1,1,1,1),(900,'201503',22,'2015-06-07 05:39:15','2015-03-31 15:59:59','',0,0,'结转凭证',2,4103,-8628.24,NULL,NULL,NULL,48,48,48,0,1,1,1,1),(905,'201504',25,'2015-06-07 05:44:14','2015-04-19 16:00:00','国家金库上海市奉贤区支库',0,2,'个税',1,222101,1151.00,NULL,NULL,NULL,48,48,1,0,1,0,0,0),(906,'201504',25,'2015-06-07 05:44:14','2015-04-19 16:00:00','国家金库上海市奉贤区支库',0,2,'个税',2,1001,1151.00,NULL,NULL,NULL,48,48,1,0,1,0,0,0),(907,'201504',26,'2015-06-07 05:44:14','2015-04-20 16:00:00','--',0,3,'手续费',1,660301,36.00,NULL,NULL,NULL,48,48,1,0,1,0,0,0),(908,'201504',26,'2015-06-07 05:44:14','2015-04-20 16:00:00','--',0,3,'手续费',2,1001,36.00,NULL,NULL,NULL,48,48,1,0,1,0,0,0),(909,'201504',27,'2015-06-07 05:46:03','2015-04-08 16:00:00','ttt',0,4,'123',1,660301,12.00,NULL,NULL,NULL,48,48,1,0,1,0,0,0),(910,'201504',27,'2015-06-07 05:46:03','2015-04-08 16:00:00','ttt',0,4,'123',2,1001,12.00,NULL,NULL,NULL,48,48,1,0,1,0,0,0),(927,'201504',30,'2015-06-10 07:14:49','2015-04-20 16:00:00','--',0,555,'手续费',0,660301,31.00,NULL,NULL,NULL,48,48,0,0,0,0,0,0),(930,'201504',33,'2015-06-10 07:20:40','2015-04-19 16:00:00','国家金库上海市奉贤区支库',0,554,'个税',0,222101,112.00,NULL,NULL,NULL,48,48,0,0,0,0,0,0),(931,'201504',33,'2015-06-10 07:20:40','2015-04-19 16:00:00','国家金库上海市奉贤区支库',0,554,'个税',1,100201,112.00,NULL,NULL,NULL,48,48,0,0,0,0,0,0),(932,'201506',6,'2015-06-11 04:01:19','2015-06-08 16:00:00','AAADFAS',0,556,'fsadfasd',1,224101,1033.00,NULL,NULL,NULL,48,48,0,0,0,0,0,0),(933,'201506',6,'2015-06-11 04:01:19','2015-06-08 16:00:00','AAADFAS',0,556,'fsadfasd',2,100203,1033.00,NULL,NULL,NULL,48,48,0,0,0,0,0,0);
/*!40000 ALTER TABLE `transition` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Temporary table structure for view `transitiondate`
--

DROP TABLE IF EXISTS `transitiondate`;
/*!50001 DROP VIEW IF EXISTS `transitiondate`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
/*!50001 CREATE TABLE `transitiondate` (
  `date` tinyint NOT NULL
) ENGINE=MyISAM */;
SET character_set_client = @saved_cs_client;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(30) NOT NULL,
  `email` varchar(100) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `auth_key` varchar(32) NOT NULL,
  `token` varchar(53) NOT NULL,
  `role` varchar(64) NOT NULL DEFAULT 'user',
  `group` int(11) NOT NULL,
  `status_id` tinyint(4) NOT NULL DEFAULT '0',
  `created_at` int(11) NOT NULL,
  `updated_at` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`),
  UNIQUE KEY `email` (`email`),
  KEY `role` (`role`),
  KEY `status_id` (`status_id`),
  KEY `created_at` (`created_at`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `vendor`
--

DROP TABLE IF EXISTS `vendor`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `vendor` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `company` varchar(256) NOT NULL,
  `vat` varchar(45) DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `add` varchar(100) DEFAULT NULL,
  `memo` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `vendor`
--

LOCK TABLES `vendor` WRITE;
/*!40000 ALTER TABLE `vendor` DISABLE KEYS */;
/*!40000 ALTER TABLE `vendor` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Final view structure for view `condomdate`
--

/*!50001 DROP TABLE IF EXISTS `condomdate`*/;
/*!50001 DROP VIEW IF EXISTS `condomdate`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8mb4 */;
/*!50001 SET character_set_results     = utf8mb4 */;
/*!50001 SET collation_connection      = utf8mb4_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`dev`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `condomdate` AS select max(`transition`.`entry_num_prefix`) AS `date` from `transition` where (`transition`.`entry_closing` = 1) */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;

--
-- Final view structure for view `transitiondate`
--

/*!50001 DROP TABLE IF EXISTS `transitiondate`*/;
/*!50001 DROP VIEW IF EXISTS `transitiondate`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `transitiondate` AS select max(`transition`.`entry_num_prefix`) AS `date` from `transition` where ((`transition`.`entry_closing` = 1) or (`transition`.`entry_settlement` = 1)) */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2015-06-22  9:01:50
